In [1]:
# Import Numpy
import numpy as np

# Import Pandas
import pandas as pd

In [2]:
# Convert list into series of elements
l = [10,20,30,40,50]
s1 = pd.Series(data = l, index = ['a','b','c','d','e'])
s1

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [3]:
print(s1)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [4]:
type(s1)

pandas.core.series.Series

In [5]:
# Convert dictionaries into series of elements
d = {'a':10,'b':20,'c':30,'d':40,'e':50}
s2 = pd.Series(d)
s2

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [6]:
# print(s2)

In [7]:
# type(s2)

In [8]:
# Addition of two series
ser1=pd.Series([1,2,3,4],['India','Srilanka', 'Bangladesh', 'Russia'])
print(ser1)
ser2=pd.Series([1,2,5,9],['India','Srilanka', 'Bangladesh', 'Russia'])
print(ser2)
print(ser1+ser2)

India         1
Srilanka      2
Bangladesh    3
Russia        4
dtype: int64
India         1
Srilanka      2
Bangladesh    5
Russia        9
dtype: int64
India          2
Srilanka       4
Bangladesh     8
Russia        13
dtype: int64

In [9]:
# Create dataframe and select columns
# Syntax - pd.DataFrame(data, index_labels , columns_labels)
df1 = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df1

          W         X         Y         Z
A  0.261488  0.283720 -0.800828 -0.458290
B  1.199543 -1.607133  0.412655 -1.504545
C  2.618533 -1.428524  0.465860  1.943315
D -0.715835  0.682952  0.430532  0.571642
E -0.591073 -0.085696  2.702217  1.424345

In [10]:
# Accessing one column of the dataframe
df1['W']

A    0.261488
B    1.199543
C    2.618533
D   -0.715835
E   -0.591073
Name: W, dtype: float64

In [11]:
# Accessing many columns in one go * pay attention that argument is passed as a list of columns names
df1[['W','Z']]

          W         Z
A  0.261488 -0.458290
B  1.199543 -1.504545
C  2.618533  1.943315
D -0.715835  0.571642
E -0.591073  1.424345

In [12]:
# Data selection with loc and iloc

# Accessing data with index values - Use loc
print(df1.loc["A"])

# Accessing the data with row numbers - Use iloc
print(df1.iloc[0])

# Access a block through your dataframe OR lets say subset the data
print(df1.loc[['A','C'],['W','Y']])

W    0.261488
X    0.283720
Y   -0.800828
Z   -0.458290
Name: A, dtype: float64
W    0.261488
X    0.283720
Y   -0.800828
Z   -0.458290
Name: A, dtype: float64
          W         Y
A  0.261488 -0.800828
C  2.618533  0.465860

In [13]:
# Subsetting based on boolean condition
df1[df1>0]

          W         X         Y         Z
A  0.261488  0.283720       NaN       NaN
B  1.199543       NaN  0.412655       NaN
C  2.618533       NaN  0.465860  1.943315
D       NaN  0.682952  0.430532  0.571642
E       NaN       NaN  2.702217  1.424345

In [14]:
# Dropping rows and columns by drop method
df1.drop('A',axis=0,inplace=False)
# df1.drop('W',axis=1,inplace=False)
# df1.drop('W',axis=1,inplace=True)
df1

          W         X         Y         Z
A  0.261488  0.283720 -0.800828 -0.458290
B  1.199543 -1.607133  0.412655 -1.504545
C  2.618533 -1.428524  0.465860  1.943315
D -0.715835  0.682952  0.430532  0.571642
E -0.591073 -0.085696  2.702217  1.424345

In [15]:
# df1['W']

In [16]:
# Subsetting plus boolean conditions
df1[df1['W']>0][['X','Y']]

          X         Y
A  0.283720 -0.800828
B -1.607133  0.412655
C -1.428524  0.465860

In [17]:
# Reset indexing 
df3 = df1.reset_index(drop =False)
df3

  index         W         X         Y         Z
0     A  0.261488  0.283720 -0.800828 -0.458290
1     B  1.199543 -1.607133  0.412655 -1.504545
2     C  2.618533 -1.428524  0.465860  1.943315
3     D -0.715835  0.682952  0.430532  0.571642
4     E -0.591073 -0.085696  2.702217  1.424345

In [18]:
# Setting indexes
df4 = df1.set_index('Z')
df4

                  W         X         Y
Z
-0.458290  0.261488  0.283720 -0.800828
-1.504545  1.199543 -1.607133  0.412655
 1.943315  2.618533 -1.428524  0.465860
 0.571642 -0.715835  0.682952  0.430532
 1.424345 -0.591073 -0.085696  2.702217

In [19]:
# Dropping missing values
d={'A':[1,2,np.NaN], 'B':[1,np.NaN,np.NaN],'C':[1,2,3]}
# np.NaN is the missing element in DataFrame
df5=pd.DataFrame(d)
print(df5)
# df5.dropna()       # Drop any row with missing value
# df5.dropna(axis=1) # Drop column with NULL value
df5.dropna(thresh=2) # Require <2 non-NA values to drop row.

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

In [20]:
# Filling missing values with something
df5['B'].fillna(value=df5['B'].mean())

0    1.0
1    1.0
2    1.0
Name: B, dtype: float64

In [21]:
# Replacing specific values
df5 = pd.DataFrame({'one':[10,20,30,40,50,2000], 'two':[1000,0,30,40,50,60]})
print(df5)
print(df5.replace({1000:10,2000:60}))

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60
   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

In [22]:
# Groupby function
data = {'Company': [ 'CompA', 'CompA', 'CompB', 'CompB', 'CompC', 'CompC'],
        'Person': ['Rajesh', 'Pradeep', 'Amit', 'Rakesh', 'Suresh', 'Raj'],
        'Sales': [200, 120, 340, 124, 243, 350]}
df6=pd.DataFrame(data)
print(df6)
comp=df6.groupby("Company")['Sales'].sum() # Grouping done using label name “Company”
comp

  Company   Person  Sales
0   CompA   Rajesh    200
1   CompA  Pradeep    120
2   CompB     Amit    340
3   CompB   Rakesh    124
4   CompC   Suresh    243
5   CompC      Raj    350

Company
CompA    320
CompB    464
CompC    593
Name: Sales, dtype: int64

In [23]:
# Finding unique value & number of occurrence from Dataframe
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
print(df)

# col1, col2 & col3 are column labels, each column have their own values
print(df['col2'].unique()) # Fetches the unique values available in column

print(df['col2'].value_counts()) # Count number of occurance of every value

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
[444 555 666]
444    2
666    1
555    1
Name: col2, dtype: int64

In [24]:
# File Handling

# Reading from a file
# df6 = pd.read_csv("test1.csv")
# print(df6)

# Writing to a file
# df6.to_csv('data.csv')

# Read a Excel File
# df = pd.read_excel('filename_with_path',sheet_name='SheetName')
# Write a Excel File with Single sheet
# df.to_excel('filename_with_path',sheet_name='SheetName')